In [105]:
import sqlite3 # импортируем библиотеку для работы с базами данных SQLite3

In [2]:
con = sqlite3.connect('db') # создаем базу данных db

In [106]:
import pandas as pd # импортируем библиотеку pandas для работы с таблицами (pip3 install pandas)

In [4]:
df = pd.DataFrame({'col1':[1,2,3]}) # создаем таблицу с одной колонкой и тремя строками

In [5]:
df.to_sql('test_table', con, index=False, if_exists='replace') # записываем таблицу в базу данных db в таблицу test_table. Если таблицы нет, она будет создана. 
# index=False - не записывать индексы строк в таблицу
# if_exists='replace' - если таблица существует, то она будет перезаписана

3

In [6]:
sql = '''select * from test_table''' # создаем запрос на выборку всех данных из таблицы test_table. Выбрать все колонки и все строки из таблицы test_table. * значит всё

In [7]:
print(sql) # выводим запрос на экран

select * from test_table

Как видим, то, что мы создали, это просто строка. Нужно как-то этот запрос направить в базу данных sql

In [8]:
pd.read_sql(sql,con) # выполняем запрос и выводим результат на экран. Конкретно команда pd.read_sql() возвращает результат запроса в виде таблицы pandas. Перввый аргумент - запрос, второй - база данных, в которой выполняется запрос.

   col1
0     1
1     2
2     3

SQL - это язык запросов. На его основе сделано много продуктов/баз данных. Например, oracle, mysql, postgres, ms sql server, sqlite3 и тп. То есть, зная SQL, можно работать во всех этих бд. Если непонятен функционал конкретной бд, то просто гуглим.

In [9]:
sqlite3.sqlite_version # выводим версию SQLite3

'3.39.5'

Теперь необходимо подключиться  какой-то СУБД (системе управления базами данных). Пусть это будет PostgreSQL. 
Делаем это, создав сервер для базы данных на elephantsql.com
Копируем оттуда URL (например, postgres://ihpploye:M5A8QuKym19byliLLJwYFNEW2oAG-HK3@balarama.db.elephantsql.com/ihpploye , но заменим начало и получим postgresql+psycopg2://ihpploye:M5A8QuKym19byliLLJwYFNEW2oAG-HK3@balarama.db.elephantsql.com/ihpploye)

In [12]:
from sqlalchemy import create_engine # импортируем библиотеку для работы с базами данных SQLAlchemy (pip3 install sqlalchemy)
con = create_engine('postgresql+psycopg2://ihpploye:M5A8QuKym19byliLLJwYFNEW2oAG-HK3@balarama.db.elephantsql.com/ihpploye')

В данном коде используется библиотека SQLAlchemy для работы с базами данных. SQLAlchemy - это SQL-инструмент для Python, который предоставляет набор высокоуровневых API для подключения и взаимодействия с базами данных.

В первой строке кода происходит импорт функции `create_engine` из библиотеки SQLAlchemy. Эта функция используется для создания нового экземпляра движка базы данных, который будет обеспечивать соединение с базой данных.

Во второй строке создается объект `con`, который представляет собой движок базы данных. Для создания этого объекта используется функция `create_engine`, в которую передается строка подключения к базе данных.

Строка подключения к базе данных обычно включает в себя тип базы данных (в данном случае PostgreSQL), используемый драйвер (psycopg2 , pip3 install psycopg2-binary), имя пользователя (ihpploye), пароль (M5A8QuKym19byliLLJwYFNEW2oAG-HK3), адрес сервера (balarama.db.elephantsql.com) и имя базы данных (ihpploye).

Обратите внимание, что в данном случае строка подключения содержит чувствительные данные (имя пользователя и пароль), которые необходимо хранить в безопасном месте и не распространять.

In [13]:
df = pd.read_csv('/Users/yanik/Desktop/Machine_Learning/SQL/sql-course/german_credit_augmented.csv')

In [14]:
df.dtypes # выводим типы данных в таблице

age                  int64
sex                 object
job                  int64
housing             object
saving_accounts     object
checking_account    object
credit_amount        int64
duration             int64
purpose             object
default              int64
contract_dt         object
client_id            int64
dtype: object

In [15]:
df.head()

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,NaN,NaN,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,NaN,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,NaN,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,NaN,776,12,radio/TV,0,2007-07-21 13:22:14,358

Как мы видим, contract_dt - это даты, но они читаются в формате строки или что-то типа того (object), поэтому применим следующую команду:

In [17]:
df['contract_dt'] = pd.to_datetime(df['contract_dt'], format='%Y-%m-%d %H:%M:%S') # преобразуем колонку contract_dt в тип данных datetime

In [18]:
df.dtypes # проверим, преобразовалось ли. Должно быть datetime64[ns]

age                          int64
sex                         object
job                          int64
housing                     object
saving_accounts             object
checking_account            object
credit_amount                int64
duration                     int64
purpose                     object
default                      int64
contract_dt         datetime64[ns]
client_id                    int64
dtype: object

Теперь нужно сделать так, чтобы наша таблица быстрее заливалась в базу данных sql. Сделать это можно, применив кастомную функцию из stack overflow:

https://stackoverflow.com/a/55495065/4527289

In [140]:
import csv
from io import StringIO

from sqlalchemy import create_engine

def psql_insert_copy(table, conn, keys, data_iter):
    # gets a DBAPI connection that can provide a cursor
    dbapi_conn = conn.connection
    with dbapi_conn.cursor() as cur:
        s_buf = StringIO()
        writer = csv.writer(s_buf)
        writer.writerows(data_iter)
        s_buf.seek(0)

        columns = ', '.join('"{}"'.format(k) for k in keys)
        if table.schema:
            table_name = '{}.{}'.format(table.schema, table.name)
        else:
            table_name = table.name

        sql = 'COPY {} ({}) FROM STDIN WITH CSV'.format(
            table_name, columns)
        cur.copy_expert(sql=sql, file=s_buf)

Сначала лучше всегда тестово грузануть несколько рандомных строк sample(5), чтобы понять, что точно всё норм и не потерять время, если таблица очень большая

In [20]:
df.sample(5).to_sql('german_credit', con, index=False, if_exists='replace', method=psql_insert_copy) # записываем таблицу в базу данных db в таблицу german_credit. Если таблицы нет, она будет создана.
# index=False - не записывать индексы строк в таблицу
# if_exists='replace' - если таблица существует, то она будет перезаписана
# В данном случае используется метод psql_insert_copy, который позволяет записывать данные в таблицу быстрее, чем стандартный метод pandas.to_sql()
# con - база данных, в которой выполняется запрос.
# 'german_credit' - название таблицы, в которую записываются данные

Теперь создадим кастомную функцию select, которая сократит время написания селектов в будущем. То есть она всегда будет применяться в таблицу под переменной 'con', но писать будем меньше:

In [21]:
def select(sql):
    return pd.read_sql(sql, con)

In [22]:
sql = '''select * from german_credit t''' # создаем запрос на выборку всех данных из таблицы german_credit. t это псевдоним таблицы german_credit. Псевдонимы используются для упрощения написания запросов.

In [23]:
select(sql) # выполняем запрос и выводим результат на экран. Конкретно команда pd.read_sql() возвращает результат запроса в виде таблицы pandas.

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,28,female,2,own,moderate,None,2073,12,radio/TV,0,2007-09-23 05:07:18,49
1,41,female,1,own,rich,None,250,6,car,0,2007-05-17 04:07:19,725
2,22,female,2,own,moderate,little,741,12,domestic appliances,1,2007-10-23 10:59:50,610
3,40,male,2,own,little,None,1585,24,furniture/equipment,0,2007-05-29 06:55:31,497
4,29,female,2,own,None,little,915,24,car,1,2007-11-11 01:38:20,240

Всё хорошо -> заливаем полностью таблицу в базу данных

In [24]:
df.to_sql('german_credit', con, index=False, if_exists='replace', method=psql_insert_copy)

In [25]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

Часто для какой-то тестовой задачки может потребоваться создать какую-то демо табличку. Делается это так:

In [26]:
import pandas as pd
df_demo = pd.DataFrame({'col1':[1,2,3],
                        'user_name':['user1','user2','user3']})

In [27]:
df_demo

   col1 user_name
0     1     user1
1     2     user2
2     3     user3

In [31]:
import sqlite3
con_demo = sqlite3.connect('db_demo')
df.to_sql('testing_table', con, index=False, if_exists='replace')

1000

In [32]:
sql = '''select * from testing_table t'''

In [33]:
def select_demo(sql):
    return pd.read_sql(sql, con_demo)

In [34]:
select_demo(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

Важно в питоне крч всё называть латиницей, только маленькие буквы и без пробелов: названия файлов, названия столбцов.

SELECT К ТАБЛИЦЕ

In [144]:
from sqlalchemy import create_engine # импортируем библиотеку для работы с базами данных SQLAlchemy (pip3 install sqlalchemy)
con = create_engine('postgresql+psycopg2://sxhiujrw:LGB3_0WaD2pSVU1O00JHd5dU3ISXxs7L@balarama.db.elephantsql.com/sxhiujrw')

In [145]:
df = pd.read_csv('/Users/yanik/Desktop/Machine_Learning/SQL/sql-course/german_credit_augmented.csv')

In [146]:
df['contract_dt'] = pd.to_datetime(df['contract_dt'],format='%Y-%m-%d %H:%M:%S')

In [147]:
df.to_sql('german_credit', con, index=False, if_exists='replace', method=psql_insert_copy) # записываем таблицу в базу данных db в таблицу german_credit. Если таблицы нет, она будет создана.

In [148]:
def select(sql):
    return pd.read_sql(sql, con)

In [149]:
sql = '''select t.age, t.housing from german_credit t''' # создаем запрос на выборку всех данных из таблицы german_credit. t это псевдоним таблицы german_credit. Псевдонимы (алиасы) используются для упрощения написания запросов. 
# Псевдонимы лучше всегда использовать, поскольку в запросах могут быть разные таблицы, у которых есть одинаковые названия колонок. Поэтому, чтобы не возникало путаницы, лучше использовать псевдонимы. 
# Самый надёжный способ вообще это указывать имя таблицы, но это долго: select german_credit.age from german_credit german_credit
# Псевдонимы видимо даются в конце запроса, после названия таблицы, но обращаться к ним можно в любом месте запроса

In [150]:
select(sql) # выполняем запрос и выводим результат на экран. Конкретно команда pd.read_sql() возвращает результат запроса в виде таблицы pandas.

     age housing
0     33     own
1     43     own
2     52     own
3     35     own
4     28     own
..   ...     ...
995   65    free
996   30     own
997   33     own
998   29     own
999   44     own

[1000 rows x 2 columns]

In [61]:
sql = '''select gc.age * 3 as age_mult3, gc.housing from german_credit as gc''' # создаем запрос на выборку всех данных из таблицы german_credit. t это псевдоним таблицы german_credit. Псевдонимы используются для упрощения написания запросов.

In [62]:
select(sql) # выполняем запрос и выводим результат на экран.

     age_mult3 housing
0           99     own
1          129     own
2          156     own
3          105     own
4           84     own
..         ...     ...
995        195    free
996         90     own
997         99     own
998         87     own
999        132     own

[1000 rows x 2 columns]

In [67]:
sql = '''select gc.*, gc.age * 3 as age_mult3, gc.age + gc.credit_amount from german_credit as gc''' # gc.* - выбрать все колонки из таблицы german_credit.

In [68]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id,age_mult3,?column?
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210,99,3107
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929,129,1387
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200,156,988
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45,105,1428
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358,84,804
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624,195,2665
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181,90,4485
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730,99,6436
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557,87,5032
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23,132,1848

In [69]:
sql = '''select gc.age * 1.0 / gc.credit_amount as age_credit_ratio from german_credit as gc''' # Домножение на 1.0 нужно для того, чтобы результат был с плавающей точкой. Иначе будет целочисленное деление. То есть результат получится без этого домножения целым, хотя нужен float.
select(sql)

     age_credit_ratio
0            0.010735
1            0.031994
2            0.055556
3            0.025126
4            0.036082
..                ...
995          0.025000
996          0.006734
997          0.005154
998          0.005797
999          0.024390

[1000 rows x 1 columns]

Как выбирать ограниченное число строк

In [70]:
sql = '''select * from german_credit as gc limit 10''' # limit 10 - ограничить выборку 10 строками

In [71]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
5,27,female,2,own,little,moderate,1295,18,furniture/equipment,0,2008-06-18 04:10:05,86
6,29,female,2,own,little,moderate,959,9,furniture/equipment,1,2007-05-21 14:32:00,351
7,42,female,2,rent,rich,rich,409,12,radio/TV,0,2008-06-05 05:31:13,27
8,26,male,2,own,little,little,4370,42,radio/TV,1,2007-11-29 00:20:44,639
9,55,male,2,free,rich,None,1555,12,repairs,1,2007-09-11 20:27:28,754

Как выбрать даты в диапазоне

In [72]:
sql = '''select * from german_credit as gc 
where gc.contract_dt between '2007-01-01' and '2007-12-31'
limit 10''' # where - условие выборки. between - между. Выбрать все строки, где contract_dt между 2007-01-01 и 2007-12-31

In [73]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
1,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
2,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
3,29,female,2,own,little,moderate,959,9,furniture/equipment,1,2007-05-21 14:32:00,351
4,26,male,2,own,little,little,4370,42,radio/TV,1,2007-11-29 00:20:44,639
5,55,male,2,free,rich,None,1555,12,repairs,1,2007-09-11 20:27:28,754
6,35,male,2,free,little,little,3386,12,car,1,2007-11-16 10:55:10,457
7,48,male,2,own,little,little,1082,12,car,1,2007-05-13 15:32:57,835
8,27,male,2,own,little,None,3850,18,car,0,2007-09-03 19:56:34,366
9,46,male,2,free,quite rich,None,727,10,education,0,2007-07-06 20:47:24,354

Как посчитать, сколько получилось наблюдений с этими датами

In [82]:
sql = '''select count(*) from german_credit as gc 
where gc.contract_dt between '2007-01-01' and '2007-12-31'
limit 10''' # count(*) - посчитать количество строк, удовлетворяющих условию выборки. Вместо * можно указать вообще что угодно видимо. Главное, чтобы что-то было написано. Иначе будет ошибка.

In [83]:
select(sql)

   count
0    573

Как упорядочить по какой-то колонке по возрастанию. По убыванию надо добавить в конце desc (order by gc.contract_dt desc)

In [ ]:
sql = '''select count(*) from german_credit as gc 
where gc.contract_dt between '2007-01-01' and '2007-12-31'
order by gc.contract_dt 
limit 10'''

Можно упорядочить по нескольким условиям.

In [ ]:
sql = '''select count(*) from german_credit as gc 
where gc.contract_dt between '2007-01-01' and '2007-12-31'
order by gc.contract_dt desc, credit_amount
limit 10''' # order by - сортировка. desc - по убыванию. Сортировка по нескольким колонкам. Сначала по contract_dt по убыванию, потом по credit_amount по возрастанию.

Условий может буть несколько

In [ ]:
sql = '''select count(*) from german_credit as gc 
where gc.contract_dt between '2007-01-01' and '2007-12-31'
and gc.purpose='car'
order by gc.contract_dt desc, credit_amount
limit 10''' # and - логическое И. Выбрать все строки, где contract_dt между 2007-01-01 и 2007-12-31 и purpose равно car

In [ ]:
sql = '''select count(*) from german_credit as gc 
where gc.contract_dt between '2007-01-01' and '2007-12-31'
and gc.purpose in ('car', 'repairs')
order by gc.contract_dt desc, credit_amount
limit 10''' # in - логическое ИЛИ. Выбрать все строки, где contract_dt между 2007-01-01 и 2007-12-31 и purpose равно car или repairs

Как заметил @Руслан_Халиков, between работает немного странно, когда в дате есть еще и время: если я напишу between '2007-01-01' and '2007-12-31' и дате есть время, то сам день 2007-12-31 в выборку не попадет, т.к. between включает все до 00:00 верхней границы. Т.е. в случае с датой и временем between не включает верхнюю границу! Поэтому, что бы точно все зафильтровать в этом случае нужно ставить between '2007-01-01' and '2008-01-01'. Ну либо можно убрать из даты время и фильтровать уже более интуитивно.

Функция LIKE. У меня почему-то запросы вылетают с ошибкой при ее применении, но крч забьём пока. Вообще должно работать

In [85]:
t = pd.DataFrame({'purpose':['машина', 'на машину', 'на покупку машины', 'автомобиль', 'на возвращение 2007'],
              'amount':[1000,400,600,700,1500]})

In [86]:
t.to_sql('purpose', con, index=False, if_exists='replace')

5

In [87]:
sql = '''select * from purpose t'''

In [88]:
select(sql)

               purpose  amount
0               машина    1000
1            на машину     400
2    на покупку машины     600
3           автомобиль     700
4  на возвращение 2007    1500

In [151]:
sql = '''
select * from purpose t
where t.purpose like '%машин%' 
''' # like - поиск по шаблону. % - любое количество любых символов. Выбрать все строки, где в колонке purpose есть слово машин

In [152]:
select(sql)

TypeError: sqlalchemy.cyextension.immutabledict.immutabledict is not a sequence

In [116]:
sql = '''select * from purpose t
where (t.purpose like '%машин%'
or t.purpose like '%авто%') and t.amount > 500
''' # or - логическое ИЛИ. Выбрать все строки, где в колонке purpose есть слово машин или авто и amount больше 500

In [117]:
select(sql)

TypeError: sqlalchemy.cyextension.immutabledict.immutabledict is not a sequence

IF THEN

In [108]:
sql = '''select count(*) from german_credit as gc'''

In [109]:
select(sql)

   count
0   1000

In [110]:
sql = '''select count(*) from german_credit as gc
where gc.credit_amount > 1000'''

In [111]:
884/1000

0.884

Но можно сделать это умнее

In [114]:
sql = '''select gc.credit_amount,
case when gc.credit_amount > 1000 then 1 else 0 end as credit_amount_more_1000
from german_credit as gc
''' # case when - если. Выбрать колонку credit_amount и создать колонку credit_amount_more_1000, которая будет равна 1, если credit_amount больше 1000, иначе 0

In [115]:
select(sql)

     credit_amount  credit_amount_more_1000
0             3074                        1
1             1344                        1
2              936                        0
3             1393                        1
4              776                        0
..             ...                      ...
995           2600                        1
996           4455                        1
997           6403                        1
998           5003                        1
999           1804                        1

[1000 rows x 2 columns]

Можно ещё iif, но это хуже и будет нечитаемо при большом кол-ве условий

In [120]:
sql = '''select gc.credit_amount,
case when gc.credit_amount > 1000 then 1 else 0 end as credit_amount_more_1000,

iif(gc.credit_amount > 1000,1,0) as credit_amount_more_1000_iif
from german_credit as gc
'''

In [121]:
select(sql)

ProgrammingError: (psycopg2.errors.UndefinedFunction) function iif(boolean, integer, integer) does not exist
LINE 4: iif(gc.credit_amount > 1000,1,0) as credit_amount_more_1000_...
        ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.

[SQL: select gc.credit_amount,
case when gc.credit_amount > 1000 then 1 else 0 end as credit_amount_more_1000,

iif(gc.credit_amount > 1000,1,0) as credit_amount_more_1000_iif
from german_credit as gc
]
(Background on this error at: https://sqlalche.me/e/20/f405)

Теперь, чтобы расчитать долю, нужно взять среднее

In [122]:
sql='''select
avg(case when gc.credit_amount > 1000 then 1 else 0 end) as credit_amount_more_1000
from german_credit as gc
'''

In [123]:
select(sql)

   credit_amount_more_1000
0                    0.884

Как сохранить результат селекта в отдельную таблицу

In [169]:
sql = '''
create table greater_1000_credit as 
select * from german_credit gc
where gc.credit_amount > 1000
'''

In [170]:
from sqlalchemy.sql import text
import sqlite3

with con.connect() as connection:
    with connection.begin():
        connection.execute(text(sql))

In [171]:
sql = '''select * from greater_1000_credit t'''

In [172]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
3,27,female,2,own,little,moderate,1295,18,furniture/equipment,0,2008-06-18 04:10:05,86
4,26,male,2,own,little,little,4370,42,radio/TV,1,2007-11-29 00:20:44,639
...,...,...,...,...,...,...,...,...,...,...,...,...
879,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
880,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
881,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
882,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
883,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

Остановился где-то на шаге 7

КОМАНДА UNION ALL объединяет таблицы вместе, присоединяя строчки одной таблицы к другой. То есть у них должно быть одинаковое количество столбцов

In [173]:
import pandas as pd
jan = pd.DataFrame({'month':['jan', 'jan'], 'revenue':[1,2]})
feb = pd.DataFrame({'month':['feb', 'feb'], 'revenue':[1,2]})

In [174]:
jan.to_sql('jan', con, index=False, if_exists='replace')
feb.to_sql('feb', con, index=False, if_exists='replace')

2

In [176]:
sql = '''select * from jan j
union all
select * from feb f
'''

In [177]:
select(sql)

  month  revenue
0   jan        1
1   jan        2
2   feb        1
3   feb        2

КОМАНДА UNION объединяет таблицы вместе, присоединяя строчки одной таблицы к другой. Но она удаляет одинаковые значения строк, то есть если у двух таблиц есть строка с число 1, то при объединении останется одна строка с 1, а не две

In [180]:
sql = '''select j.revenue from jan j
union
select f.revenue from feb f
'''

In [181]:
select(sql)

   revenue
0        2
1        1

Ну а чтобы различать после объединения где какой месяц, можно захардкодить и просто вписать месяца

In [184]:
sql = '''select j.revenue,
'jan' as month
from jan j
union all
select f.revenue, 
'feb' as month
from feb f
'''

In [185]:
select(sql)

   revenue month
0        1   jan
1        2   jan
2        1   feb
3        2   feb

Задание: как запарсить из поля 'sex' первую букву. Гуглим в инете команду. Первое слово запроса это всегда база данных, в которой работаем. Postgresql ...

In [186]:
sql = '''select t.sex, left(t.sex, 1) from german_credit t'''

In [187]:
select(sql)

        sex left
0      male    m
1      male    m
2      male    m
3    female    f
4      male    m
..      ...  ...
995    male    m
996    male    m
997    male    m
998  female    f
999    male    m

[1000 rows x 2 columns]

СВОДНЫЕ ТАБЛИЦЫ (GROUP BY)

In [192]:
sql = '''select gc.sex,
count(1), 
avg(gc.credit_amount) as credit_amount_avg


from german_credit gc
group by gc.sex'''

In [193]:
select(sql)

      sex  count  credit_amount_avg
0  female    310        2877.774194
1    male    690        3448.040580

In [200]:
sql = '''select count(distinct t.housing), count(t.housing) from german_credit t''' # distinct - уникальные значения. Выбрать уникальные значения из колонки housing

In [201]:
select(sql)

   count  count
0      3   1000

ПРОПУСКИ В SQL

In [214]:
sql = '''select count(t.checking_account) from german_credit t'''

In [215]:
select(sql)

   count
0    606

Должна быть 1000, а получилось 606

In [216]:
sql = '''select gc.checking_account,
count(1), 
avg(gc.credit_amount) as credit_amount_avg


from german_credit gc
group by gc.checking_account'''

In [217]:
select(sql)

  checking_account  count  credit_amount_avg
0         moderate    269        3827.561338
1             None    394        3133.101523
2           little    274        3175.218978
3             rich     63        2177.650794

А вот так пропуски учтены, в отличие от Pandas, где, например, пропуски пропускаются и не учитываются.

In [223]:
sql = '''select
sum(case when t.checking_account is null then 1 else 0 end) as is_null, 

count(case when t.checking_account is null then 1 else null end) as is_null_count
 from german_credit t''' # внимание, что для count 0 это не пропуск, поэтому он считается. Поэтому вместо 0 нужно писать null, чтобы он не учитывался.

In [224]:
select(sql)

   is_null  is_null_count
0      394            394

In [225]:
import numpy as np
t = pd.DataFrame({'col1':[1,np.nan,2]})

In [226]:
t

   col1
0   1.0
1   NaN
2   2.0

In [227]:
t.to_sql('null_test', con, index=False, if_exists='replace')

3

In [234]:
sql = '''select avg(t.col1) from null_test t'''

In [235]:
select(sql)

   avg
0  1.5

Как переименовать Nan во что-то другое

In [238]:
sql = '''select gc.checking_account,
coalesce(gc.checking_account, 'no_info') as checking_account_coalesce



from german_credit gc''' # coalesce - заменить null на другое значение. Выбрать колонку checking_account и создать колонку checking_account_coalesce, в которой null заменены на no_info

In [239]:
select(sql)

    checking_account checking_account_coalesce
0               None                   no_info
1             little                    little
2               None                   no_info
3               None                   no_info
4               None                   no_info
..               ...                       ...
995           little                    little
996         moderate                  moderate
997         moderate                  moderate
998             None                   no_info
999         moderate                  moderate

[1000 rows x 2 columns]

In [240]:
import numpy as np
t = pd.DataFrame({'col1':[1,np.nan,2],
                 'col2':[np.nan,np.nan,1],
                 'col3':[1,2,3]})

In [241]:
t

   col1  col2  col3
0   1.0   NaN     1
1   NaN   NaN     2
2   2.0   1.0     3

In [242]:
t.to_sql('null_test', con, index=False, if_exists='replace')

3

In [249]:
sql = '''select t.*, coalesce(t.col1, t.col2, t.col3) from null_test t''' # coalesce - выбрать первое не null значение из списка. В данном случае выбрать первое не null значение из колонок col1, col2, col3

In [250]:
select(sql)

   col1  col2  col3  coalesce
0   1.0   NaN     1       1.0
1   NaN   NaN     2       2.0
2   2.0   1.0     3       2.0

КАК РАБОТАТЬ С ДУПЛИКАТАМИ

In [251]:
t = pd.DataFrame({'id':[1,1,2], 'name':['a', 'a', 'b']})

In [252]:
t

   id name
0   1    a
1   1    a
2   2    b

In [253]:
t.to_sql('duplicates_test', con, index=False, if_exists='replace')

3

In [259]:
sql = '''select t.id, t.name, count(1) as cnt from duplicates_test t
group by t.id, t.name'''

In [260]:
select(sql)

   id name  cnt
0   1    a    2
1   2    b    1

In [261]:
sql = '''select t.id, t.name, count(1) as cnt from duplicates_test t
group by t.id, t.name
having count(1) > 1''' # having - условие для группировки. Выбрать id и name, где количество строк в группе больше 1

In [262]:
select(sql)

   id name  cnt
0   1    a    2

In [270]:
t = pd.DataFrame({'id':[1,1,2,2,3],
                'name':['a', 'b', 'c', 'd', 'e']})

In [271]:
t

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [272]:
t.to_sql('duplicate_test', con, index=False, if_exists='replace')

5

In [275]:
sql = '''select t.id, count(1) as cnt from duplicate_test t
group by t.id
having count(1) > 1'''

In [276]:
select(sql)

   id  cnt
0   2    2
1   1    2

In [277]:
sql = '''select * from duplicate_test t
where t.id in (1,2)''' # Тут можно вывести через перечисление все id, которые повторяются. Но это неудобно, если их много. Тогда нужно использовать ПОДЗАПРОС

In [278]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

In [281]:
sql = '''select * from duplicate_test t
where t.id in (select t.id as cnt from duplicate_test t
group by t.id
having count(1) > 1)'''

In [282]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d